Documents/АК_ЗаявкаНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АК_ЗаявкаНаПеревозку</Name>
			<BasedOn>
				<xr:Item>Document.ПеремещениеСклад</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АК_ВидыПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановойДоставки</Name>
					<Comment>Дата плановой доставки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗаявкиНаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласовалПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасходныеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасходныйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйОрдерСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаявокНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АК_ЗаявкаНаПеревозку/Forms/ФормаДокумента/Ext/Form/Module.bsl
//+++АК sole 2018.07.12 ИП-00018320.04
&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;		
КонецФункции

//+++АК sole 2018.07.12 ИП-00018320.04
Функция ПолучитьФСтатус()
	
	Перем фСтатус;
	
	фСтатус = Новый Структура();
	
	Если ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.Черновик")  Тогда
		фСтатус.Вставить("Черновик", Истина);
	Иначе
		фСтатус.Вставить("Черновик", Ложь);
	КонецЕсли;
	
	Если ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.НаСогласовании")  Тогда
		фСтатус.Вставить("НаСогласовании", Истина);
	Иначе
		фСтатус.Вставить("НаСогласовании", Ложь);
	КонецЕсли;
	
	Если ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.Согласована")  Тогда
		фСтатус.Вставить("Согласована", Истина);
	Иначе
		фСтатус.Вставить("Согласована", Ложь);
	КонецЕсли;
	
	Если ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.Выполнена")  Тогда
		фСтатус.Вставить("Выполнена", Истина);
	Иначе
		фСтатус.Вставить("Выполнена", Ложь);
	КонецЕсли;
	
	Если ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.Отменена")  Тогда
		фСтатус.Вставить("Отменена", Истина);
	Иначе
		фСтатус.Вставить("Отменена", Ложь);
	КонецЕсли;	
	
	Возврат фСтатус;
КонецФункции 

//+++АК sole 2018.07.12 ИП-00018320.04
&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Перем ФинальныйСтатус;
	Перем СтатусЧерновик;
	Перем фСтатус;
	
	фСтатус = ПолучитьФСтатус();
	
	ЕстьРольПолныеПрава = РольДоступна("ПолныеПрава");
	ЕстьРольСогласующийЗаявкуНаПеревозку = РольДоступна("СогласующийЗаявкуНаПеревозку");
		
	Если 
			фСтатус.Согласована
		Или фСтатус.Выполнена
		Или ФСтатус.Отменена
	Тогда
		ФинальныйСтатус = Истина;
	Иначе
		ФинальныйСтатус = Ложь;	
	КонецЕсли;
	
	ЭтаФорма.Элементы.Статус.Доступность = ЕстьРольПолныеПрава;
	
	ЭтаФорма.Элементы.Сумма.ТолькоПросмотр = Не фСтатус.Черновик;
	ЭтаФорма.Элементы.Организация.ТолькоПросмотр = Не фСтатус.Черновик;
	ЭтаФорма.Элементы.ВидПеревозки.ТолькоПросмотр = Не фСтатус.Черновик;
	ЭтаФорма.Элементы.Перевозчик.ТолькоПросмотр = Не фСтатус.Черновик;
	ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Не фСтатус.Черновик;
	
	ЭтаФорма.Элементы.Дата.ТолькоПросмотр = ФинальныйСтатус;
	ЭтаФорма.Элементы.ДатаПлановойДоставки.ТолькоПросмотр = ФинальныйСтатус;
	
	//Кнопки
	ЭтаФорма.Элементы.Отменить.Доступность = Не (фСтатус.Выполнена Или фСтатус.Отменена);
	ЭтаФорма.Элементы.ОтправитьНаСогласование.Доступность = фСтатус.Черновик;
	
	Если   
			фСтатус.НаСогласовании
		И 	(
					ЕстьРольСогласующийЗаявкуНаПеревозку
				Или ЕстьРольПолныеПрава
			)
	Тогда
		ЭтаФорма.Элементы.Согласовать.Доступность = Истина;	
		ЭтаФорма.Элементы.Отклонить.Доступность = Истина;	
	Иначе
		ЭтаФорма.Элементы.Согласовать.Доступность = Ложь;	
		ЭтаФорма.Элементы.Отклонить.Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры 

//+++АК sole 2018.07.12 ИП-00018320.04
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормы();
	ЭтаФорма.Товары.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ЭтаФорма.Объект.ДокументОснование);
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	ОтправитьНаСогласование_НаСервере();
КонецПроцедуры

//+++АК sole 2018.08.01 ИП-00018320.06
&НаСервере
Процедура ОтправитьНаСогласование_НаСервере()
	
	оЗаявка = РеквизитФормыВЗначение("Объект");
	оЗаявка.ОтправитьСообщениеДляСогласования();
	
	ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.НаСогласовании");
	ЭтаФорма.Объект.ДатаОтправкиЗаявкиНаСогласование = ТекущаяДата();
	ЭтаФорма.Записать();
	
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаКлиенте
Процедура Согласовать(Команда)
	ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.Согласована");	
	ЭтаФорма.Объект.СогласовалПользователь = ПолучитьТекущегоПользователя();
	ЭтаФорма.Записать();
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.Отменена");
	ЭтаФорма.Записать();
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаКлиенте
Процедура Отклонить(Команда)
	ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаПеревозку.Черновик");
	ЭтаФорма.Записать();
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();	
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();	
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаКлиенте
Процедура ЗаполнитьИзПеремещениеСклад(ДанныеЗаполнения) Экспорт
	ЗаполнитьИзПеремещениеСклад_НаСервере(ДанныеЗаполнения);	
КонецПроцедуры

//+++АК sole 2018.07.12 ИП-00018320.04
&НаСервере
Процедура ЗаполнитьИзПеремещениеСклад_НаСервере(ДанныеЗаполнения)
	оЗаявкаНаПеревозку = РеквизитФормыВЗначение("Объект");
	оЗаявкаНаПеревозку.Заполнить(ДанныеЗаполнения);
	ЭтаФорма.Товары.Параметры.УстановитьЗначениеПараметра("ДокументОснование", оЗаявкаНаПеревозку.ДокументОснование);
	ЗначениеВРеквизитФормы(оЗаявкаНаПеревозку, "Объект");
КонецПроцедуры

//+++АК sole 2018.07.16 ИП-00018320.04
&НаКлиенте
Процедура ПеревозчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ФормаВыбора = ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораУправляемая",, Элемент);
	ОсновнойОтбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОсновнойОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОсновнойОтбор.Использование = Истина;
	ОсновнойОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	ОсновнойОтбор.ПравоеЗначение = ПолучитьСсылкуГруппаКонтрагентовТранспорт();
	
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;

КонецПроцедуры

//+++АК sole 2018.07.16 ИП-00018320.04
&НаСервере
Функция ПолучитьСсылкуГруппаКонтрагентовТранспорт()
	Возврат Справочники.Контрагенты.НайтиПоКоду("000000519");		
КонецФункции
